package com.example.myapplication.model;

import java.util.ArrayList;
import java.util.List;

//============================================================
//　処理概要　:　CollateDataクラス
//　機　能　　:　積載束照合データ（ヘッダ＋明細）を保持するデータモデル
//============================================================
public class CollateData {

    //================================================================
    //　項　目　:　containerID
    //　内　容　:　コンテナID
    //　備　考　:　要素名 containerID（先頭小文字）
    //================================================================
    public String containerID;

    //================================================================
    //　項　目　:　syogoKanryo
    //　内　容　:　照合完了フラグ
    //　備　考　:　要素名 syogoKanryo（先頭小文字）
    //================================================================
    public boolean syogoKanryo;

    //================================================================
    //　項　目　:　collateDtls
    //　内　容　:　照合明細一覧
    //　備　考　:　要素名 CollateDtls（先頭大文字C）
    //================================================================
    public List<CollateDtl> collateDtls = new ArrayList<>();
}