package com.example.myapplication.model;

//============================================================
//　処理概要　:　CollateDtlクラス
//　機　能　　:　積載束照合明細情報を保持するデータモデル
//============================================================
public class CollateDtl {

    //================================================================
    //　項　目　:　collateDtlheatNo
    //　内　容　:　ヒートNo
    //================================================================
    public String collateDtlheatNo;

    //================================================================
    //　項　目　:　collateDtlsokuban
    //　内　容　:　測番
    //================================================================
    public String collateDtlsokuban;

    //================================================================
    //　項　目　:　collateDtlsyougoKakunin
    //　内　容　:　照合確認フラグ
    //================================================================
    public boolean collateDtlsyougoKakunin;
}