package com.example.myapplication.model;

//============================================================
//　処理概要　:　SyougoDtlクラス
//　機　能　　:　照合明細情報を保持するデータモデル
//============================================================
public class SyougoDtl {

    //================================================================
    //　項　目　:　syogoDtlheatNo
    //　内　容　:　ヒートNo
    //================================================================
    public String syogoDtlheatNo;

    //================================================================
    //　項　目　:　syogoDtlsokuban
    //　内　容　:　測番
    //================================================================
    public String syogoDtlsokuban;

    //================================================================
    //　項　目　:　syougoDtlsyukkaSashizuNo
    //　内　容　:　出荷指図No
    //================================================================
    public String syougoDtlsyukkaSashizuNo;

    //================================================================
    //　項　目　:　syougoDtlbundleNo
    //　内　容　:　束No
    //================================================================
    public String syougoDtlbundleNo;

    //================================================================
    //　項　目　:　syougoDtljyuryo
    //　内　容　:　重量
    //================================================================
    public int syougoDtljyuryo;

    //================================================================
    //　項　目　:　syougoDtlcontainerID
    //　内　容　:　コンテナID
    //================================================================
    public String syougoDtlcontainerID;

    //================================================================
    //　項　目　:　syougoDtlsyougoKakunin
    //　内　容　:　照合確認フラグ
    //================================================================
    public boolean syougoDtlsyougoKakunin;
}