package com.example.myapplication.model;

import java.util.ArrayList;
import java.util.List;

//============================================================
//　処理概要　:　通信・画面で扱うデータを保持するクラス
//　機　能　　:　出荷データ（ヘッダ／明細）を保持するデータモデル
//============================================================
public class SyukkaData {

    //============================================================
    //　項　目　:　header
    //　内　容　:　出荷ヘッダ情報一覧
    //============================================================
    public List<SyukkaHeader> header = new ArrayList<>();

    //============================================================
    //　項　目　:　meisai
    //　内　容　:　出荷明細情報一覧
    //============================================================
    public List<SyukkaMeisai> meisai = new ArrayList<>();
}
